"""Tool for the VoyageGenie"""
import json
from typing import Optional, Type, List, Any, Dict

from langchain_core.callbacks import CallbackManagerForToolRun
from langchain_core.pydantic_v1 import BaseModel, Field
from langchain_core.tools import BaseTool

from .tools.aggregation import *

class GetEventsSchema(BaseModel):
    """Input"""

    city: str = Field(
        description="游玩目的地城市"
    )
def callback_fun(r,content):
    r.event_cache_load(f"[get_events]{json.dumps(content)}")

class GetEvents(BaseTool):
    """工具"""

    name: str = "在目的地寻找值得一去的地方"
    description: str = (
        "一个工具，作用：输入游玩目的地（城市），输出一系列值得游客一去并且符合用户喜好的旅游地点，包括三类：游玩地点、美食、住所。同时包括每个项目的介绍。"
    )
    args_schema: Type[BaseModel] = GetEventsSchema
    # callbacks=callback_fun

    # def __init__(self,r):
    #     self.callbacks = r

    def _run(
        self,
        city: str,
    ) -> Dict[str,List[Any]]:
        """Use the tool."""
        # foods:Dict[str,Any]=food_data(city,_min,_max)
        # sights:Dict[str,Any]=sight_data(city,_min,_max)
        # hotel:dict[str,Any]=hotel_data(city,_min,_max)
        op = test_output
        # op = entertainment_data(city)
        # callback_fun(self.receiver,op)
        return op


test_output:Dict[str,List[Any]]={
    "sight": [
        {
            "name": "上海野生动物园", 
            "introduce": "欢迎来到上海野生动物园，这里将唤起您心中对于大自然的美好向往与满满好奇，我们也将为您诠释一座人与动物和谐共处的美好家园。作为国内首批5A级旅游景区，一直以来，我们都在努力拉近人与自然之间的距离。园内步行区、车入区及“水域探秘”三大区域将为您从不同角度呈现国内外200余种，上万头（只）野生动物。", 
            "details": {
                "count": 3, 
                "item": [
                    {
                        "title": "开放时间", 
                        "content": "01/01-06/30 09:00-17:00开放;07/01-10/07 09:00-22:00开放;10/08-11/30 09:00-17:00开放;12/01-12/31 09:00-16:30开放，车入区运行时间：\n1月1日-6月30日、10月8日-11月30日 9:15-16:30；\n7月1日-10月7日  9:15-21:30；\n12月1日-12月31日 9:15-15:30。\n\n水域运行时间：\n1月1日-6月30日、10月8日-11月30日 9:15-16:30；\n7月1日-10月7日  9:15-21:30；\n12月1日-12月31日 9:15-15:30。"
                    }, 
                    {
                        "title": "优待政策", 
                        "content": "儿童：6周岁（含）或1.3米（含）以下的儿童跟随购票成年人入园\n（1名成人限带1名免票儿童），免费老人： 65周岁（含）以上，凭可证明年龄的有效证件购买，半价； 60周岁（含）~64周岁（含）老年人，凭可证明年龄的有效证件购买，9折学生：全日制大学本科及以下学历学生凭学生证，研究生和成人教育除外，半价现役军人：凭现役军官证、现役士兵证、文职证、武装警察部队警官证，免费离退休干部：凭离休干部证，免费革命伤残军人：凭革命军人伤残证，免费革命烈士家属：凭革命烈士家属证，免费残疾人：凭残疾证，免费消防救援人员：凭消防员证，免费导游：凭导游证，免费未成年人：6周岁(不含)-18周岁(含)未成年人凭有效证件，半价补充说明： 入园取票时一定要带好能证明身份的证件，比如学生证、户口本、身份证。初中及以上的学生务必带好有效学生证，否则可能造成无法入园。以上信息仅供参考，具体信息请以上海野生动物园当天披露为准。"
                    }, 
                    {
                        "title": "服务设施", 
                        "content": "停车场：【停车场】参考价格：小车每辆每次收费30元，大巴车每辆每次收费40元（具体以景区现场为准）；地址：浦东新区南六公路178号；库位：以景区现场为准WIFI：账号：Shwzoo；密码：手机验证码登录后免费使用；范围：园区行李寄存：参考价格：小柜寄存柜：10元/天；中柜寄存柜：20元/天；大柜寄存柜：40元/天；地址：票务中心左手边寄存柜或游客服务中心；具体以景区现场为准景区地图：可在景区官网或下载上海野生动物园APP查看电子地图童车租赁：参考价格：以现场为准；地址：票务中心左手边、景区内共享童车租赁或服务中心轮椅租赁：参考价格：具体以景区现场为准；地址：游客服务中心卫生间：景区指示牌母婴室：地址：部分园内厕所设有母婴室餐饮：上海野生动物园内设有多个餐厅，分别是老虎餐厅、火烈鸟餐厅、猎豹餐吧等，具体位置可在游园地图上查看自动售卖机：景区游客服务中心"
                    }
                ], 
                "intro": "欢迎来到上海野生动物园，这里将唤起您心中对于大自然的美好向往与满满好奇，我们也将为您诠释一座人与动物和谐共处的美好家园。作为国内首批5A级旅游景区，一直以来，我们都在努力拉近人与自然之间的距离。园内步行区、车入区及“水域探秘”三大区域将为您从不同角度呈现国内外200余种，上万头（只）野生动物。您不仅能邂逅大熊猫、长颈鹿、火烈鸟等可爱的动物朋友，还能零距离感受东北虎、非洲狮、猎豹等猛兽的野性呼唤。这里也是动物们在这座城市的温馨家园，我们始终致力于提升动物福利保障、宣传动物保护理念。保育员会在固定时段为您带来丰富的“科普讲解”与“动物行为展示”，让您了解动物们鲜为人知的一面。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/0101f12000acizecb31EF_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0107312000a2d6ep71531_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0105o12000a2xkk5z2A7D_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0100x12000a2d6b592F90_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市浦东新区南六公路178号", 
            "score": "4.7", 
            "rank": "2024全球100亲子景点", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "浦东机场店", 
                        "address": "上海市浦东新区南六公路与寅旺路交叉口东340米", 
                        "distance": "224米", 
                        "type": "住宿服务;宾馆酒店;宾馆酒店"
                    }, 
                    {
                        "name": "上海快乐之家住宿", 
                        "address": "上海市浦东新区宣桥镇人民西路上海野生动物园南墙边(上海浩人物流有限公司隔壁)", 
                        "distance": "436米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }
                ]
            }
        }, 
        {
            "name": "外滩", 
            "introduce": "外滩位于黄浦江畔，全长约1.5公里，是上海城市象征意义的景点，风格迥异的万国建筑群和浦江夜景是它的精华所在。外滩矗立着几十幢风格迥异的古典复兴大楼，知名的中国银行大楼、和平饭店、海关大楼、汇丰银行大楼等再现了昔日“远东华尔街”的风采。令人惊讶的是，这些建筑并非出自同一位设计师，也不是建于同一时期，却拥有一种独特的和谐美。外滩多种建筑风格，其中包括法国古典式、法国大住宅式、哥特式等，这些都是中国近现代重要史迹及代表性建筑，也是黄浦江畔一道靓丽的风景线。夜晚来临，两岸霓虹灯交辉相映，搭乘浦江游船或渡轮，游于黄浦江上，江风阵阵拂面，一边是见证历史发展的外滩，一边是上海现代建设的地标陆家嘴，还有外白渡桥的倩丽身影，可以让你换个角度欣赏这个繁华都市美丽的样子。", 
            "details": {
                "count": 1, 
                "item": [
                    {
                        "title": "开放时间", 
                        "content": "全年 全天开放"
                    }
                ], 
                "intro": "外滩位于黄浦江畔，全长约1.5公里，是上海城市象征意义的景点，风格迥异的万国建筑群和浦江夜景是它的精华所在。外滩矗立着几十幢风格迥异的古典复兴大楼，知名的中国银行大楼、和平饭店、海关大楼、汇丰银行大楼等再现了昔日“远东华尔街”的风采。令人惊讶的是，这些建筑并非出自同一位设计师，也不是建于同一时期，却拥有一种独特的和谐美。外滩多种建筑风格，其中包括法国古典式、法国大住宅式、哥特式等，这些都是中国近现代重要史迹及代表性建筑，也是黄浦江畔一道靓丽的风景线。夜晚来临，两岸霓虹灯交辉相映，搭乘浦江游船或渡轮，游于黄浦江上，江风阵阵拂面，一边是见证历史发展的外滩，一边是上海现代建设的地标陆家嘴，还有外白渡桥的倩丽身影，可以让你换个角度欣赏这个繁华都市美丽的样子。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/10040m000000dht6p0F19_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/100h0z000000mkjxn58E1_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/100o0b0000005bxej3E7E_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/100c0u000000jjrxyD76A_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市黄浦区中山东一路（临黄浦江）", 
            "score": "4.8", 
            "rank": "2024全球100夜游景点", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "上海东方美仑美奂酒店", 
                        "address": "上海市黄浦区金陵东路1号", 
                        "distance": "349米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆"
                    }, 
                    {
                        "name": "上海浦东香格里拉", 
                        "address": "上海市浦东新区富城路33号(陆家嘴地铁站10号口步行430米)", 
                        "distance": "490米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "豫园", 
            "introduce": "上海豫园位于上海豫园旅游商业区的东北部，与上海城隍庙、上海豫园旅游商城毗邻，是知名的江南古典园林，闻名中外的名胜古迹。1982年被国 务院批准成为“全国重点文物保护单位”。豫园始建于明嘉靖、万历年间，距今已有四百五十余年历史。园主人潘允端，曾任四川布政使。潘允端为了让父亲安享晚年，从明嘉靖己未年（1559年）起，在自家的菜田上，聚石凿池，构亭艺竹，建造园林。经过二十余年的苦心经营，建成了豫园。“豫”有“平安”、“安泰”之意，取名“豫园”，有“豫悦老亲”的意思。豫园肇建初始，占地七十余亩，由明代造园名家张南阳精心设计，并亲自参与施工，整座园林规模宏伟、景色秀美。", 
            "details": {
                "count": 3, 
                "item": [
                    {
                        "title": "开放时间", 
                        "content": "02/01-02/08 周二-周日 09:00-16:30开放;02/01-02/08 周一 全天不开放;02/09 周五 09:00-14:30开放;02/10-02/17 09:00-16:00开放;02/18-12/31 周二-周日 09:00-16:30开放;02/18-12/31 周一 全天不开放;清明节,劳动节,端午节,中秋节,国庆节 09:00-16:30开放"
                    }, 
                    {
                        "title": "优待政策", 
                        "content": "学生：1、6周岁（不含）以上至18周岁（含）未成年人，凭本人身份证、户口本或者护照。\n2、全日制大学本科及以下学历学生（不含成人教育、研究生）凭本人学生证及身份证。，半价老人：60周岁（含）以上老人凭本人身份证享受半价优惠。，半价儿童：身高1.3米（含）以下或6周岁（含）以下儿童（须有成人陪护，一名成人限带三名儿童；非团体）。，免费残疾人：凭有效证件登记验证后入园。，免费现役军人、残疾军人、烈士遗属、因公牺牲军人遗属、病故军人遗属、现役军人家属：凭有效证件登记验证后入园。，免费消防人员（含消防救援院校学员）：凭有效证件登记验证后入园。，免费"
                    }, 
                    {
                        "title": "服务设施", 
                        "content": "卫生间：分布在万花楼东侧、涵碧楼东侧"
                    }
                ], 
                "intro": "上海豫园位于上海豫园旅游商业区的东北部，与上海城隍庙、上海豫园旅游商城毗邻，是知名的江南古典园林，闻名中外的名胜古迹。1982年被国 务院批准成为“全国重点文物保护单位”。豫园始建于明嘉靖、万历年间，距今已有四百五十余年历史。园主人潘允端，曾任四川布政使。潘允端为了让父亲安享晚年，从明嘉靖己未年（1559年）起，在自家的菜田上，聚石凿池，构亭艺竹，建造园林。经过二十余年的苦心经营，建成了豫园。“豫”有“平安”、“安泰”之意，取名“豫园”，有“豫悦老亲”的意思。豫园肇建初始，占地七十余亩，由明代造园名家张南阳精心设计，并亲自参与施工，整座园林规模宏伟、景色秀美。现豫园占地2公顷，楼阁参差，山石峥嵘，树木苍翠，以清幽秀丽，玲珑剔透见长，具有小中见大的特点，体现出明清两代江南园林建筑的艺术风格。豫园内至今还保存着“海派书画”发祥地—“藏书楼”、上海小刀会起义指挥部所在“点春堂”等史迹。历代古人对豫园有“奇秀甲于东南”、“东南名园冠”等赞誉。众多国内外政要首脑和名人都曾来到豫园参观访问，是上海一张难得的传统文化名片。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/1A0hhk124f849nma8EBD7_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0100k1200096jdh6pD284.png", 
                "https://dimg04.c-ctrip.com/images/100g1d000001eog159F4A_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0104f1200096jdpqoAE2D_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市黄浦区福佑路168号", 
            "score": "4.7", 
            "rank": "上海近期热门景点榜 No.3", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "桔子水晶上海外滩豫园酒店", 
                        "address": "上海市黄浦区人民路399号(豫园地铁站7号口步行170米)", 
                        "distance": "161米", 
                        "type": "住宿服务;宾馆酒店;经济型连锁酒店"
                    }, 
                    {
                        "name": "上海侯盼盼普通公寓", 
                        "address": "上海市黄浦区上海上海黄浦区福佑路225号福佑商厦(福佑路店)", 
                        "distance": "97米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }
                ]
            }
        }, 
        {
            "name": "黄浦江游览(十六铺码头)", 
            "introduce": "乘船游览黄浦江是领略上海都市繁华景色的游览方式之一，做为上海的百年老码头，从十六铺码头出发，黄浦江以西是外滩万国建筑群，黄浦江以东则是现代化的陆家嘴金融区。等到夜幕降临时，两岸灯光璀璨，景色更是美丽。十六铺码头有3个区域，有着“快乐船长”、“龙船”、“水晶公主”、“精华游”等多个航班。游船从拥有一百多年历史的十六铺码头出发，顺江而下，首先看到的便是摩天大楼云集的陆家嘴金融区，东方明珠、金茂大厦、上海环球金融中心等地标性建筑都在这里。再经过气势恢宏的杨浦大桥和拥有百余年历史的外白渡桥，就是古典庄重、集多种建筑风格的万国建筑群了，风景十分美丽。", 
            "details": {
                "count": 3, 
                "item": [
                    {
                        "title": "开放时间", 
                        "content": "全年 11:00-22:00开放，精华游：日游15：30-17：30，夜游18：00-20：30（具体班次以现场换票为准，航程时间：45分钟）。\n龙船：17：30登船，航行时间 19:00-21:00。  \n快乐船长：18:30-20:30。  \n水晶公主轮：17:00-20:45。"
                    }, 
                    {
                        "title": "优待政策", 
                        "content": "儿童：1.3米(含)以下免票(须领登船票)（1位成人只可携带1名免票儿童），免费；1.3米（不含）—1.5米（含），半价老人：70周岁（含）以上老人凭有效证件，半价军残、警残、消防残疾人士：本人持有效证件，半价补充说明：所有优惠政策均不能与其他优惠叠加使用"
                    }, 
                    {
                        "title": "服务设施", 
                        "content": "停车场：【十六铺水岸停车场】参考价格：¥15/小时；地址：黄浦区中山东二路585号；库位：600卫生间：设有多个卫生间，在售票大厅、船舱内等附近并标有醒目的指示牌。自动售卖机：码头"
                    }
                ], 
                "intro": "乘船游览黄浦江是领略上海都市繁华景色的游览方式之一，做为上海的百年老码头，从十六铺码头出发，黄浦江以西是外滩万国建筑群，黄浦江以东则是现代化的陆家嘴金融区。等到夜幕降临时，两岸灯光璀璨，景色更是美丽。十六铺码头有3个区域，有着“快乐船长”、“龙船”、“水晶公主”、“精华游”等多个航班。游船从拥有一百多年历史的十六铺码头出发，顺江而下，首先看到的便是摩天大楼云集的陆家嘴金融区，东方明珠、金茂大厦、上海环球金融中心等地标性建筑都在这里。再经过气势恢宏的杨浦大桥和拥有百余年历史的外白渡桥，就是古典庄重、集多种建筑风格的万国建筑群了，风景十分美丽。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/35091e000001ey01xBB09_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0106a1200086nwg345B82_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0102d1200086nwkhkB13F_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/350k1e000001ezs35F11A_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市中山东二路551号十六铺游船二区码头", 
            "score": "4.6", 
            "rank": "上海必打卡景点榜 No.6", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "上海外滩英迪格酒店", 
                        "address": "上海市黄浦区中山东二路585号", 
                        "distance": "106米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆"
                    }, 
                    {
                        "name": "上海外滩英迪格酒店英迪", 
                        "address": "上海市黄浦区中山东二路与外马路交叉口东40米", 
                        "distance": "86米", 
                        "type": "住宿服务;宾馆酒店;宾馆酒店"
                    }
                ]
            }
        }, 
        {
            "name": "上海海昌海洋公园", 
            "introduce": "上海海昌海洋公园被评定为国家4A级旅游景区，以海洋文化为主题，缔造五大区域和一个度假酒店，拥有《虎鲸科普秀》《海狮特快》《海豚奇缘》等十六大明星剧目；设有南极企鹅馆、海兽探秘馆等六大动物展示场馆，提供火山漂流、海豚过山车等十余项游乐设施，汇聚三万余只海洋生物 。奥特曼主题馆是上海海昌海洋公园&新创华联合打造的主题馆，位于上海海昌海洋公园内海底奇域主题区，由奥特曼主题展示区、 奥特曼主题餐厅、奥特曼冰封剧场、奥特曼光之店、奥特曼游艺中心五大主题区组成。", 
            "details": 
            {
                "count": 3, 
                "item": [
                    {
                        "title": "开放时间", 
                        "content": "07/01-08/31 09:00-21:00开放"
                    }, 
                    {
                        "title": "优待政策", 
                        "content": "儿童：身高1.0米(含)以下或者3周岁(不含)以下（需持本人身份证等有效证件原件，购票成人陪同），免费；身高1.0米(不含)-1.4米(含)之间或者年龄3周岁(含)-11周岁(含)之间，优惠老人：60周岁(含)以上（持本人有效身份证件），优惠军人：现役军人、残疾军人、烈士遗属、因公牺牲军人遗属、病故军人遗属、现役军人家属、在职/退休消防救援人员和消防救援院校学员（持本人有效证件至现场购买），优惠残疾人：凭有效证件，优惠补充说明：以上信息仅供参考，具体信息请以景区当天披露为准。"
                    }, 
                    {
                        "title": "服务设施", 
                        "content": "停车场：【上海海昌海洋公园停车场】参考价格：①上午11:30前入场，每辆每天人民币80元； ②上午11:30后入场，每辆每天人民币50元。；地址：上海市浦东新区南汇新城镇银飞路200号；库位：约1000个；2023年12月30日起，除本园区酒店住客外所有其他游客，进出场超30分钟的，须付费停车；\n请注意：一日内重复进出需另行支付费用。行李寄存：参考价格：大件80元/件，中件60元/件（园外）；小件50元/件（园内检票广场）；地址：园区童车租赁：参考价格：单人童车80元/车/天，押金200元、双人童车100元/车/天，押金200元；；地址：童车租赁；车辆体重限制标准：单人童车限25kg，双人童车限45kg轮椅租赁：参考价格：免费，押金300元；地址：轮椅租赁卫生间：园区内设有多个卫生间，有明显标识。"
                    }
                ], 
                "intro": "上海海昌海洋公园被评定为国家4A级旅游景区，以海洋文化为主题，缔造五大区域和一个度假酒店，拥有《虎鲸科普秀》《海狮特快》《海豚奇缘》等十六大明星剧目；设有南极企鹅馆、海兽探秘馆等六大动物展示场馆，提供火山漂流、海豚过山车等十余项游乐设施，汇聚三万余只海洋生物 。奥特曼主题馆是上海海昌海洋公园&新创华联合打造的主题馆，位于上海海昌海洋公园内海底奇域主题区，由奥特曼主题展示区、 奥特曼主题餐厅、奥特曼冰封剧场、奥特曼光之店、奥特曼游艺中心五大主题区组成。上海海昌海洋公园《蓝星战队》海陆机甲大巡游，重磅呈现。巡游队伍总长近200米、总重超60吨的十余“头”机甲巨兽天团，每日于景区冰雪王国主题区域霸气上演。结合IP互娱、沉浸演艺、主题巡游于一体，将给游客朋友们带来极大的震撼与感官冲击。园区具体开放区域(以景区当日开放为准):游乐设备：海豚过山车，火山漂流，时空缆车，深海奇航，急速企鹅，快乐小飞鱼，飞天巨鱼，海洋木马，鹈鹕大冒险;演艺及场馆：虎鲸科普秀，奥特曼场馆，奥特曼电音广场，海陆机甲大巡游，海狮特快，海兽探秘馆/海兽科普喂食秀，海豚奇缘，小镇派对 ，部落狂欢，雨林风情，水上飞人。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/1lo1l12000eiq8wblB242_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0106r120009q537g7656D_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0106s120009q53j2yAE1E_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0103v120009q537v5F77B_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市浦东新区南汇新城镇银飞路166号", 
            "score": "4.5", 
            "rank": "2024亚洲100亲子景点", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "上海海昌海洋公园度假酒店", 
                        "address": "上海市浦东新区杞青路777号", 
                        "distance": "210米", 
                        "type": "住宿服务;宾馆酒店;宾馆酒店"
                    }, 
                    {
                        "name": "海昌海洋公园夜宿", 
                        "address": "上海市浦东新区杞青路与麦冬路交叉口西南360米", 
                        "distance": "71米", 
                        "type": "住宿服务;旅馆招待所;旅馆招待所"
                    }
                ]
            }
        }, 
        {
            "name": "上海迪士尼度假区", 
            "introduce": "上海迪士尼度假区位于上海浦东新区，是中国内地第一个迪士尼度假区，你可以在此亲历许多迪士尼乐园的经典项目，包括较大的迪士尼城堡、以海盗为主题的园区、较长的迪士尼花车巡游路线等，身临其境地感受神奇王国。迪士尼乐园上海迪士尼乐园分为八个各具特色的主题园区，包括“米奇大街”、“奇想花园”、“梦幻世界”、“迪士尼·皮克斯玩具总动员”、“探险岛”、“宝藏湾”、“明日世界”和“疯狂动物城”。无论男女老少都能在这里找到快乐的天地。", 
            "details": {
                "count": 3, 
                "item": [
                    {
                        "title": "开放时间", "content": "07/25-08/11 08:30-21:30开放"
                    }, 
                    {
                        "title": "优待政策", 
                        "content": "儿童：年龄在3周岁（含）-11周岁（含）或身高1.0米（不含）-1.4米（含），在入园时，其监护人必须携带并出示能被接受的儿童本人含出生日期及照片的政府签发的有效身份证件原件。\n未满16周岁的游客须由16周岁及以上的游客陪同入园。，优惠；在游园当日年龄在3周岁（不含）以下或身高1米及以下的婴幼儿游客可免票入园，免费老人：年龄60周岁（含）及以上（按生日计算年龄，以出行日期为准），优惠残疾人：残障人士入园时须携带本人有效身份证原件及本人有效残障证明原件，在主入口通过“中国残疾人联合会”微信公众号的“证件查询”页面验证本人的残疾证后方可入园。入园时无法出示本人的有效残障证明原件，或无法通过页面验证的游客，须按标准票的全价补全差价。，优惠"
                    }, 
                    {
                        "title": "服务设施", 
                        "content": "停车场：【P1停车场】参考价格：¥15/小时；地址：上海迪士尼度假区南一入口星光大道；库位：1413；小型车辆10元/小时，80元封顶；大型车辆15元/小时，120元封顶；【P2停车场】参考价格：¥15/小时；地址：上海迪士尼度假区南二入口灵感街；库位：920；小型车辆10元/小时，80元封顶；大型车辆15元/小时，120元封顶；【P3停车场】参考价格：¥15/小时；地址：上海迪士尼度假区东入口阳光大道；库位：2474；小型车辆10元/小时，80元封顶；大型车辆15元/小时，120元封顶；【P4停车场】参考价格：¥15/小时；地址：上海迪士尼度假区东入口阳光大道；库位：1032；【P5停车场】参考价格：¥60/次；地址：上海迪士尼度假区申迪西路附近迪士尼停车场；库位：3390；【P6停车场】参考价格：¥120/次；地址：上海迪士尼度假区西入口迪士尼大道；库位：5210；小型车辆100元/次，大型车辆120元/次行李寄存：参考价格：以景区现场公示为准；地址：米奇大街,创急速光轮，雷鸣山漂流，古迹探索营童车租赁：参考价格：90元/部/天；地址：主题乐园主入口处的闸机处轮椅租赁：参考价格：90元/部/天；地址：主入口处的闸机后卫生间：上海迪士尼度假区主题乐园内外多处设有洗手间，非常便利。当你进入主题乐园，跟着路牌就能找到他们的具体位置。“星愿公园”、“迪士尼小镇”和上海迪士尼度假区停车场附近也设有洗手间。如有疑问，请随时向演职人员寻求帮助。吸烟区：地理位置：“米奇大街”主题园区内的“甜心糖果”商店；“探险岛”主题园区入口标牌处；“探险岛”主题园区的“故事舞台”；“宝藏湾”主题园区的“凡迭戈剧院”出口；“宝藏湾”主题园区的“加勒比海盗：沉落宝藏之战”演出；“奇想花园”主题园区的“米奇俱乐部”；“明日世界”主题园区的“星球大战远征基地”；“明日世界”主题园区巡游路线（洗手间对面）；“梦幻世界”主题园区游客服务中心对面；“梦幻世界”主题园区的“魔法师秘制小食”餐厅母婴室：地址：以景区现场公示为准；护婴中心人员齐备，将在上海迪士尼乐园常规运营期间为游客提供免费服务和一系列便利设施，包括：配备电视机和桌椅的客厅、配备椅子的母婴室、配备桌子的更衣室、配备高脚椅的喂哺室、微波炉和水槽。残障通道：持残疾证的残障人士，可在主入口的游客服务中心获取残障人士通行服务卡。残障人士通行服务是专为由于残障原因而无法长时间等待的游客设计，此服务允许持卡游客在当前景点需要长时间等候时，提前预约返回景点的时间。如需了解详细信息，请向演职人员咨询。ATM机：上海迪士尼度假区内ATM（自动取款机）设在以下位置：主入口游客服务中心区域—乐园内；主入口游客服务中心区域—乐园外；团队接待中心区域—停车场内；迪士尼小镇服务中心区域；医务室区域——“明日世界”主题园区内；上海迪士尼乐园酒店；玩具总动员酒店餐饮：上海迪士尼乐园内设有多个餐厅，分别在米奇大街附近并标有醒目的指示牌。可使用支付宝/微信支付。纪念品商店：上海迪士尼纪念品商店位于迪士尼小镇，是一座巨大而醒目的圆形建筑。"
                    }
                ], 
                "intro": "上海迪士尼度假区位于上海浦东新区，是中国内地第一个迪士尼度假区，你可以在此亲历许多迪士尼乐园的经典项目，包括较大的迪士尼城堡、以海盗为主题的园区、较长的迪士尼花车巡游路线等，身临其境地感受神奇王国。迪士尼乐园上海迪士尼乐园分为八个各具特色的主题园区，包括“米奇大街”、“奇想花园”、“梦幻世界”、“迪士尼·皮克斯玩具总动员”、“探险岛”、“宝藏湾”、“明日世界”和“疯狂动物城”。无论男女老少都能在这里找到快乐的天地。#米奇大街#一进入迪士尼乐园门口，便步入了“米奇大街”。米妮、唐老鸭、黛丝、高飞以及布鲁托等一众伙伴将在这里欢聚，你可以在这里与喜爱的迪士尼朋友热情拥抱、合影留念。在大街上五花八门的商铺中，“M大街购物廊”将提供乐园内丰富的礼品和纪念品选择。#奇想花园#奇想花园由7片不同风格的神奇小花园组成，你可以驾着“幻想曲旋转木马”回旋在欢乐中，或是乘坐“小飞象”翱翔天空，还有城堡舞台秀和“奇梦之光幻影秀”等多项标志性迪士尼娱乐演出可供观赏。游客还能在这里从不同角度欣赏全球路线较长的迪士尼主题花车巡游——“米奇童话专列”。#梦幻世界#梦幻世界是乐园中较大的园区，也是宏伟壮丽的“奇幻童话城堡”所在地。在这个如童话般的仙境中，动画控们可以伴着小熊维尼探索百亩森林，和爱丽丝一起在梦游仙境迷宫中穿行，与七个小矮人一同乘坐矿山车探险，登上“小飞侠天空奇遇”飞船横越伦敦的天空，或是跟着“晶彩奇航”蜿蜒漂流过一个个熟悉的迪士尼故事。#迪士尼·皮克斯玩具总动员#在这里，你可以坐上“弹簧狗”的螺旋形弹簧，欢快地围着一个盛满了玩具骨头的大狗盘绕圈，“抱抱龙”将邀请大家坐上遥控冲天赛车，在长长的“U”型轨道上开启一段刺激的冒险旅程，除此之外，你还可以在“艾尔玩具店”，购买你喜欢的游戏、玩具、服饰、徽章等。#探险岛#来到探险岛，仿佛置身于新发现的远古部落中。巍峨的雷鸣山将为你的探险岛之旅指出明确的方向。你可以在“古迹探索营”中走出自己的探险之路，或是在“翱翔•飞越地平线”里横跨世界和时空，坐上“雷鸣山漂流”的筏艇深入探险岛腹地，探索一只庞大神秘巨兽所在的黑暗领域。#宝藏湾#“宝藏湾”是全球迪士尼乐园中第一个以海盗为主题的园区。“加勒比海盗——沉落宝藏之战”将水载乘坐项目变为惊险刺激的大冒险，富有探险精神的游客们还可以划着“探险家独木舟”畅游美丽海湾，踏上海盗船的甲板，在“巴波萨烧烤”大快朵颐。#明日世界#“明日世界”充满了无尽可能并展现出未来光明的愿景。星际探险项目“巴斯光年星际营救”带领游客们勇往直前、超越无限；“喷气背包飞行器”让人们突破重力束缚；“创极速光轮”包裹在巨大的半透明穹顶建筑下，幻化着不同光彩，吸引游客跨上两轮光轮摩托队列，挑战全球迪士尼乐园中较为紧张刺激的过山车项目之一。#疯狂动物城#“疯狂动物城”是上海迪士尼乐园另一独有亮点，新的景点、娱乐演出、商品和餐饮选择将为来访上海迪士尼乐园的游客提供更多精彩体验。全新主题园区将带领游客进入栩栩如生的“疯狂动物城”这一哺乳动物大都会，“在这里每个动物都有无限的可能性”。游客还将跟随这部奥斯卡获奖电影中的主角——朱迪和尼克踏上疯狂刺激的冒险旅程。迪士尼小镇迪士尼小镇是上海迪士尼度假区的大型购物餐饮娱乐区，毗邻上海迪士尼乐园，并将向公众免费开放。国际化的迷人街区令人流连忘返，游客可以在享用美食的同时观赏到上海迪士尼乐园的迷人景色。而位于“迪士尼小镇”的“华特迪士尼大剧院”，上演经典百老汇音乐剧。园区餐饮迪士尼乐园中有巴波萨烧烤、皇室宴会厅、皮诺丘乡村厨房、部落丰盛堂、米奇好伙伴美味集市、星露台餐厅、老藤树食栈等多家主题餐厅，散布在各个主题园区内，东西方菜系的丰富美食、特色点心和诱人甜品一应俱全，让你的神奇之旅回味无穷。主题酒店“上海迪士尼乐园酒店”和“上海玩具总动员酒店”紧邻上海迪士尼乐园，优越的地理位置将迪士尼神奇之旅从白天延续到夜晚。两家酒店结合了迪士尼故事讲述的主题设计，并将为宾客提供温馨周到的服务、丰富多样的娱乐活动、美食飨宴、购物体验及各种休闲选择，带来蕴含中国魅力的迪士尼体验。如果在乐园中购买了商品，可以免费递送至其下榻的酒店中，另外度假区内还设有免费穿梭巴士和轮渡，往返于两座酒店和迪士尼乐园之间，交通十分方便。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/1lo6e12000ej3nl1x1E52.png", 
                "https://dimg04.c-ctrip.com/images/01055120008ji2uc75021_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/100h050000000m88w1495_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/100h0q000000gehggB658_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市浦东新区川沙新镇黄赵路310号", 
            "score": "4.7", 
            "rank": "2024全球100必打卡景点", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "素简民宿", 
                        "address": "上海市浦东新区鹿顺路汇领商墅", 
                        "distance": "292米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海鸿鹄之志公寓(3号店)", 
                        "address": "上海市浦东新区上海浦东新区迪士尼小镇(唐镇地铁站旁边)", 
                        "distance": "367米", "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }
                ]
            }
        }, 
        {
            "name": "东方明珠", 
            "introduce": "东方明珠矗立于上海浦东陆家嘴，与外滩隔江相望，是上海的标志性建筑。若在267米高的空中旋转餐厅一边品尝美食一边欣赏申城夜景，更是超凡的体验。东方明珠塔高468米，由11个大小不一的球体串联一体，此设计来源于“大珠小珠落玉盘”的美妙意境。登上三个主球体，可站在不同的高度品赏浦江两岸的城市风光，尤其站在259米高度的全透明观光廊上，以“空中漫步”的独特方式欣赏申城全景。而夜晚登临观光层感受“不夜城”夜幕下的绚彩，更是难忘的享受。东方明珠还是娱乐、美食、博览以及购物的小世界。在塔座的上海城市历史发展陈列馆可以了解到上海近代历史的变迁；在东方明珠95米“高空VR过山车”一起尖叫一起飞；玩累了，可以到旋转餐厅品尝世界各地美食、欣赏现场制作与烹饪表演。结束旅程时，可至特色商品楼层选购纪念品，或买张明信片、盖上空中邮局的邮戳，寄给自己或者想要祝福的亲友。", 
            "details": {
                "count": 3, 
                "item": [
                    {
                        "title": "开放时间", 
                        "content": "全年 09:00-21:00开放"
                    }, 
                    {
                        "title": "优待政策", 
                        "content": "儿童：1米(不含)以下，免费；身高1米(含)-1.3米(含)或年龄6周岁(含)以下，半价老人/残疾人：70周岁(不含)以上老人及残疾人，凭有效证件购票，三球联票、二球联票、单球票、陈列馆票，优惠(餐厅票除外)特殊人群：现役军人、军残证、离休干部、烈属证：凭有效证件，享受（二球联票），免费"
                    }, 
                    {
                        "title": "服务设施", 
                        "content": "行李寄存：参考价格：以景区现场为准；地址：游客中心卫生间：景区内设有多个卫生间，在景区内均标有醒目的指示牌。餐饮：东方明珠内设有多个餐厅，分别在不同观光层并标有醒目的指示牌。纪念品商店：东方明珠内设有多个纪念品商店，在0米大厅附近并标有醒目的指示牌。"
                    }
                ], 
                "intro": "东方明珠矗立于上海浦东陆家嘴，与外滩隔江相望，是上海的标志性建筑。若在267米高的空中旋转餐厅一边品尝美食一边欣赏申城夜景，更是超凡的体验。东方明珠塔高468米，由11个大小不一的球体串联一体，此设计来源于“大珠小珠落玉盘”的美妙意境。登上三个主球体，可站在不同的高度品赏浦江两岸的城市风光，尤其站在259米高度的全透明观光廊上，以“空中漫步”的独特方式欣赏申城全景。而夜晚登临观光层感受“不夜城”夜幕下的绚彩，更是难忘的享受。东方明珠还是娱乐、美食、博览以及购物的小世界。在塔座的上海城市历史发展陈列馆可以了解到上海近代历史的变迁；在东方明珠95米“高空VR过山车”一起尖叫一起飞；玩累了，可以到旋转餐厅品尝世界各地美食、欣赏现场制作与烹饪表演。结束旅程时，可至特色商品楼层选购纪念品，或买张明信片、盖上空中邮局的邮戳，寄给自己或者想要祝福的亲友。"
            }, 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/010691200097uy8rk36FE_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0105a120009i3g4xgE014_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/0104t120009i3g5v767BE_D_521_391.jpg", 
                "https://dimg04.c-ctrip.com/images/100s0f0000007i4q0E47E_D_521_391.jpg"
            ], 
            "imgCount": 4, 
            "city": "上海", 
            "address": "上海市浦东新区陆家嘴世纪大道1号", 
            "score": "4.7", 
            "rank": "2024全球100夜游景点", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "上海东方明珠230空中酒店", 
                        "address": "上海市浦东新区世纪大道1号(陆家嘴地铁站1号入口步行320米)", 
                        "distance": "39米", 
                        "type": "住宿服务;宾馆酒店;宾馆酒店"
                    }, 
                    {
                        "name": "上海东方滨江大酒店(国际会议中心)", 
                        "address": "上海市浦东新区滨江大道2727号上海国际会议中心F1层", 
                        "distance": "307米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆"
                    }
                ]
            }
        }
    ], 
    "food": [
        {
            "name": "酱爆猪肝", 
            "introduce": "酱爆猪肝作为传统的上海家常菜之一，制作方法讲究用大火快炒。上海有一句老话“猪肝下锅十八铲”，就是说在料理猪肝的时候，翻炒速度要迅速才能留住猪肝的鲜味。酱爆猪肝营养丰富又美味，还可以随意与主食搭配，比如作为浇头搭配面条食用，这样简单又传统的吃法深受大众喜爱。\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/100i0k000000c45522189_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n 进贤路130号 ", 
            "store": "兰心餐厅(进贤路店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "椒盐排条", 
            "introduce": "椒盐排条是一道深受大众喜爱的家常菜，先将猪肋骨炸至金黄后，再和椒盐一起炒制而成，少许的椒盐不仅不会抢夺肉的咸香，又能解去油炸后的油腻感。做好的椒盐排条外焦里嫩，口味咸鲜，香味浓郁，好吃得让人停不下来。\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/10020k000000cbkc12C2E_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n 瑞金二路街道进贤路240号 ", 
            "store": "海金滋(陕西南路店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "上海小笼包", 
            "introduce": "小笼包对于上海人而言不仅是一种食物，更是一种生活态度，充分体现了上海人的精致和讲究。上海小笼包皮薄肉美汤鲜，吃法极其讲究，需要“轻轻提、慢慢移、先开窗、后喝汤、结尾一扫而光”，论优雅论体面，上海小笼包当属其中翘楚。如今的上海小笼包花样繁多，鹅肝馅的、榴莲馅的、蟹粉馅的……应有尽有。\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/1006080000003e1eu4999_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n上海市静安区彭浦镇高平路51号(雅悦新天地对面)", 
            "store": "上味馆南翔小笼(高平路店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "糖醋小排", 
            "introduce": "糖醋小排是一道色香味俱全的名菜，冷热皆宜，在沪多为冷盘。这道菜以肥瘦相间的猪肋排为主料，经过多道程序烹制后色泽鲜亮，表面一层浓郁的糖醋汁酸甜可口，食之令人胃口大开，是偏好糖醋又乐于尝鲜的老饕们不容错过的美食。\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/tg/991/587/696/8efe5a3ec6d94546a040c1c16c8f3c42_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n巨鹿路768号巨富大厦2楼", 
            "store": "南麓·浙里(巨鹿店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "八宝辣酱", 
            "introduce": "八宝辣酱，是上海知名特色菜之一。八宝辣酱采用了鸡丁、肉丁、笋丁、虾仁、花生米等原料，经豆瓣酱炒制而成，味道香中带辣，故名“八宝辣酱”。一道菜中融合了甜、咸、辣、鲜多重口味，且口感丰富，极富上海本帮菜特色。\n\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/tg/980/731/955/a7dd9e01bccf451fac642b1226a0005b_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n上海市黄浦区打浦路1号金玉兰广场2层", 
            "store": "金时代顺风大酒店(金玉兰店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "上海熏鱼", 
            "introduce": "上海熏鱼外焦里嫩，入口甜香。制作时采用传统工艺，先将腌制入味的草鱼段放入油中炸至金黄后捞出，再放入多种香料和佐料熬制成的酱汁中浸泡，直至上色入味。做好的上海熏鱼，外观呈琥珀色，皮脆肉鲜，甜中带咸，味道醇厚，入口香脆鲜甜。\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/1002080000003e1a4F552_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n莘建东路399弄26支弄27号(莘庄地铁站北广场北2出口向西200米)", 
            "store": "老爸厨房(莘建东路店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }, 
        {
            "name": "本帮红烧肉", 
            "introduce": "你要是问一个上海人喜欢吃什么菜，十有八九是红烧肉。本帮红烧肉采用肥瘦相间的五花肉制成，色泽红亮，恰到好处的火候烹煮出肥而不腻的口感，香浓咸甜、浓油赤酱是其特点。浓油赤酱也是上海菜的美食偏好，代表了上海人的美食口味。\n                ", 
            "imgs": [
                "https://dimg04.c-ctrip.com/images/100p080000003e1l502C6_R_510_300.jpg"
            ], 
            "imgCount": 1, 
            "city": "上海", 
            "address": "\n上海市黄浦区中山东二路505号", 
            "store": "RIVIERA松鹤楼江景宴会厅(外滩店)", 
            "hotel": {
                "count": 10, 
                "hotels": [
                    {
                        "name": "安小邱公寓(人民大道分店)", 
                        "address": "上海市黄浦区人民大道人民大厦", 
                        "distance": "10米", 
                        "type": "住宿服务;住宿服务相关;住宿服务相关"
                    }, 
                    {
                        "name": "上海明天广场JW万豪酒店", 
                        "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
                        "distance": "385米", 
                        "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
                    }
                ]
            }
        }
    ], 
    "hotel": [
        {
            "name": "浦东机场店", 
            "address": "上海市浦东新区南六公路与寅旺路交叉口东340米", 
            "distance": "224米", 
            "type": "住宿服务;宾馆酒店;宾馆酒店"
        }, 
        {
            "name": "上海快乐之家住宿", 
            "address": "上海市浦东新区宣桥镇人民西路上海野生动物园南墙边(上海浩人物流有限公司隔壁)", 
            "distance": "436米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        },
        {
            "name": "上海东方美仑美奂酒店", 
            "address": "上海市黄浦区金陵东路1号", 
            "distance": "349米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆"
        },
        {
            "name": "上海浦东香格里拉", 
            "address": "上海市浦东新区富城路33号(陆家嘴地铁站10号口步行430米)", 
            "distance": "490米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "桔子水晶上海外滩豫园酒店", 
            "address": "上海市黄浦区人民路399号(豫园地铁站7号口步行170米)", 
            "distance": "161米", 
            "type": "住宿服务;宾馆酒店;经济型连锁酒店"
        }, 
        {
            "name": "上海侯盼盼普通公寓", 
            "address": "上海市黄浦区上海上海黄浦区福佑路225号福佑商厦(福佑路店)", 
            "distance": "97米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海外滩英迪格酒店", 
            "address": "上海市黄浦区中山东二路585号", 
            "distance": "106米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆"
        }, 
        {
            "name": "上海外滩英迪格酒店英迪", 
            "address": "上海市黄浦区中山东二路与外马路交叉口东40米", 
            "distance": "86米", 
            "type": "住宿服务;宾馆酒店;宾馆酒店"
        }, 
        {
            "name": "上海海昌海洋公园度假酒店", 
            "address": "上海市浦东新区杞青路777号", 
            "distance": "210米", 
            "type": "住宿服务;宾馆酒店;宾馆酒店"
        }, 
        {
            "name": "海昌海洋公园夜宿", 
            "address": "上海市浦东新区杞青路与麦冬路交叉口西南360米", 
            "distance": "71米", 
            "type": "住宿服务;旅馆招待所;旅馆招待所"
        }, 
        {
            "name": "素简民宿", 
            "address": "上海市浦东新区鹿顺路汇领商墅", 
            "distance": "292米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海鸿鹄之志公寓(3号店)", 
            "address": "上海市浦东新区上海浦东新区迪士尼小镇(唐镇地铁站旁边)", 
            "distance": "367米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海东方明珠230空中酒店", 
            "address": "上海市浦东新区世纪大道1号(陆家嘴地铁站1号入口步行320米)", 
            "distance": "39米", 
            "type": "住宿服务;宾馆酒店;宾馆酒店"
        }, 
        {
            "name": "上海东方滨江大酒店(国际会议中心)", 
            "address": "上海市浦东新区滨江大道2727号上海国际会议中心F1层", 
            "distance": "307米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }, 
        {
            "name": "安小邱公寓(人民大道分店)", 
            "address": "上海市黄浦区人民大道人民大厦", 
            "distance": "10米", 
            "type": "住宿服务;住宿服务相关;住宿服务相关"
        }, 
        {
            "name": "上海明天广场JW万豪酒店", 
            "address": "上海市黄浦区南京西路399号(人民广场地铁站11号口步行240米)", 
            "distance": "385米", 
            "type": "住宿服务;宾馆酒店;五星级宾馆|餐饮服务;餐饮相关场所;餐饮相关"
        }
    ]
}